{
  "format": "layers-model",
  "generatedBy": "keras v3.5.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.5.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 28, 28, 1],
              "dtype": "float32",
              "name": "input_layer"
            }
          },
          ...
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "https://raw.githubusercontent.com/jonocen/Project1/main/TFJS_Model/group1-shard1of2.bin",
        "https://raw.githubusercontent.com/jonocen/Project1/main/TFJS_Model/group1-shard2of2.bin"
      ],
      "weights": [
        { "name": "conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" },
        { "name": "conv2d/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [2048, 784], "dtype": "float32" },
        { "name": "dense/bias", "shape": [784], "dtype": "float32" },
        ...
      ]
    }
  ]
}
