{
  "format": "layers-model",
  "generatedBy": "keras v3.5.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.5.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 28, 28, 1],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [3, 3],
              "padding": "valid",
              "strides": [3, 3],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 784,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 196,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 49,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 24,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 10,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [null, 28, 28, 1]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.001,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07
        }
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "https://raw.githubusercontent.com/jonocen/Project1/main/TFJS_Model/group1-shard1of2.bin",
          "https://raw.githubusercontent.com/jonocen/Project1/main/TFJS_Model/group1-shard2of2.bin"
        ],
        "weights": [
          {
            "name": "conv2d/kernel",
            "shape": [3, 3, 1, 32],
            "dtype": "float32"
          },
          {
            "name": "conv2d/bias",
            "shape": [32],
            "dtype": "float32"
          },
          {
            "name": "dense/kernel",
            "shape": [2048, 784],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [784],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel",
            "shape": [784, 196],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [196],
            "dtype": "float32"
          },
          {
            "name": "dense_2/kernel",
            "shape": [196, 49],
            "dtype": "float32"
          },
          {
            "name": "dense_2/bias",
            "shape": [49],
            "dtype": "float32"
          },
          {
            "name": "dense_3/kernel",
            "shape": [49, 24],
            "dtype": "float32"
          },
          {
            "name": "dense_3/bias",
            "shape": [24],
            "dtype": "float32"
          },
          {
            "name": "dense_4/kernel",
            "shape": [24, 10],
            "dtype": "float32"
          },
          {
            "name": "dense_4/bias",
            "shape": [10],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
}
